Revit 2027 API
ParameterTypeId.RbsElecRoomAverageIllumination Property
 "Average Estimated Illumination"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecRoomAverageIllumination { get; }
Public Shared ReadOnly Property RbsElecRoomAverageIllumination As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecRoomAverageIllumination {
	ForgeTypeId^ get ();
}
static member RbsElecRoomAverageIllumination : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace